{
  "id": 4457,
  "name": "Ty'rell Pounds",
  "age": 24,
  "race": "B",
  "gender": "M",
  "armed": "gun",
  "location": "Crestwood",
  "date": "2/11/2019",
  "photo": "https://www.fatalencounters.org/wp-content/uploads/2019/02/Tyrell-Pounds.png",
  "video": "e5vaVBbdgHU",
  "description": "OLDHAM COUNTY, Ky. (WKRC) - Kentucky State Police confirmed that 20-year-old Skylar Williams -- who was kidnapped at gunpoint from the Ohio State University's Mansfield, Ohio, campus -- and the suspect, 24-year-old Ty'rell Pounds, are both dead after a chase and officer-involved shooting in Oldham County, Kentucky Monday night.\n\nWilliams, a student at the school, was allegedly abducted Monday at gunpoint by Pounds, according to the OSU Department of Public Safety. A disturbing Facebook post seems to allude to the tragic ending of the kidnapping.\n\nPounds wrote, \"I'm so sorry you have to grow up without us.\" It was a message to his young son, who he had with Williams. They were in court just last week because of a custody dispute.\n\nKSP say the chase started when someone called 911 in Gallatin County. The caller said they saw a woman, later identified as Williams, in distress and being forced into a car by Pounds at a gas station. The caller said it appeared the woman was asking for help and that the vehicle sped off toward southbound I-71.\n\nKSP found the vehicle and tried to pull Pounds over, but he fled. The chase went on for at least 20 minutes until Pounds crashed the car on an exit ramp in Oldham County. KSP said while trying to apprehend Pounds, a trooper heard a gunshot coming from within the car, which he perceived as a deadly threat to himself and Williams.\n\nThe trooper fired at Pounds, striking and killing him. Williams was struck by at least one round of gunfire. She was taken to a hospital in Louisville where she was pronounced dead.\n\nNo one else was hurt. KSP is currently investigating the shootings. KSP said they may hold a news conference on the shootings Wednesday."
}