{
  "id": 4816,
  "name": "Elijah Collins III",
  "age": 32,
  "race": "B",
  "gender": "M",
  "armed": "sharp object",
  "location": "Sugarcreek",
  "date": "6/26/2019",
  "photo": "https://fatalencounters.org/wp-content/uploads/2019/07/Elijah-Collins.jpg",
  "video": "078KAno2ufk",
  "description": "#officerinvolvedshooting  #Sugarcreekpolicedepartment #officerstabbedscrewdriver\n\nSUGARCREEK, Ohio — The Sugarcreek Police Department --- A Sugarcreek Police Officer is recovering in an Akron hospital after being stabbed by a man during a traffic stop.\n\nAfter being stabbed, 37-year-old Police Captain Brian Dalton shot and killed the male suspect. The incident took place around 10 a.m. Wednesday near TMK Farm Service in Tuscarawas County.\n\nThe motorist had reportedly driven through a no-trucks zone, damaging property. He allegedly stabbed Dalton in the neck with a screwdriver after the being told he would need to appear in court on a property damaging charge.\n\nPolice have identified the deceased male as Elijah Collins III, 32-years-old truck driver from High Point, N.C\n\nCollins died of a gun shot injury according to the Tuscarawas Office of the Coroner. Dr. Cameron has released the name of the decedent involved in the incident in Sugarcreek.\n\n✅My entire channel has been demonetized. If ever you want to support the channel you could toss a $1 or $2 one-time tip or more if you want at:\n💲https://www.paypal.me/VideoLeakPolice .\nOr\n🟡Bitcoin: 1D5dqpHKvBq5Kg6C1wjyt68cpTqYaod6Uf.\nThank you for watching and thank you for your support and help.\n\n🔴Video Leak police on Bitchute (Like YouTube) https://www.bitchute.com/channel/cHahYjdeaKbV/\n\n🚨♦Disclaimer🚨: This video is NOT intended to be violent or glorify violence in any way. We are sharing the footage STRICTLY for the purposes of news reporting and educating. for training purpose, for public safety, to expose an injustice, documenting or foster debate about important events.🚨\n\nVideo Leak Police Primary Publish The New Police Dash Cam, , Police Officer Involved Shooting, Police Officer Body Camera footage releases. , New Police chases and more.\nAlso Video Leak Police publish news reporting videos, educational, for training purpose, Under Mini Documentary form, For public safety, to expose an injustice, documenting or foster debate about important events.\n\n🛑For any concern or Copyright Issue🛑 Please *Message me* ›\nhttps://www.facebook.com/videoleak01/\nor\n🛑https://www.youtube.com/channel/UCbQ4rmsy9dxaq5G6Om2DvfA/about?view_as=public\n\nYou are Welcome to Subscribe Here: https://www.youtube.com/c/VideoLeakPolice\n\nVideo Leak is Under Section 107 of the Copyright Act 1976, allowance is made for «fair use» for purposes such as criticism, comment, news reporting, teaching, scholarship, and research."
}