{
  "id": 4867,
  "name": "Witney Rivera",
  "age": 41,
  "race": "H",
  "gender": "M",
  "armed": "garden tool",
  "location": "Pemberton",
  "date": "7/19/2019",
  "photo": "https://fatalencounters.org/wp-content/uploads/2019/07/Witney-Rivera.jpg",
  "video": "OGMD8518AkI",
  "description": "A New Jersey police officer is seen on bodycam footage shooting a dog that charged at him while on the street.\n\nOfficer Emanuel Rivera was on Tall Oaks Drive Saturday afternoon after someone in Vernon Township called the police about an aggressive dog on the loose. The cop asked neighbors in the area about a dog, and some said the pet — named Hiro — had lived with a family on the street for three years and was friendly.\n\nThe man who was seen on video telling the officer about the dog said he was \"pretty scared\" that the dog was going to bite him.\n\nOfficer Rivera then went to a nearby home asking a woman who the dog belonged to and the neighbor said Hiro is owned by the home next door.\n\nWhen the officer approached the driveway of the home where Hiro lived, the dog came sprinting down the driveway barking. The officer can be seen backing away and heard telling the dog to \"back up.\" The cop continued to order the dog to back down as he pulled out his gun.\n\nThe body camera stops right before the officer fires his weapon, killing the animal. Police said the dog was aggressive and the officer felt threatened.\n\nHiro, a Labrador mix who was rescued from a kill shelter, was a very friendly dog, according to his adoptive family.\n\nNBC 4 New York on Twitter: http://4.nbcny.com/kAuuwUN\nNBC 4 New York on Facebook: http://4.nbcny.com/mbeh714\nNBC 4 New York on Instagram: http://4.nbcny.com/g5YlkcI\nNBC 4 New York on Youtube: http://4.nbcny.com/iTUpy5e\n\n#NJ\n#News\n#NewJersey\n-----------------------------------------------\n\nNBC 4 New York / WNBC is the flagship station of the NBC Owned Television Stations division of NBCUniversal, serving the New York Tri-State area with an unparalleled commitment to broadcast excellence for more than 75 years. For more information about NBC 4 New York, visit NBCNewYork.com."
}