{
  "id": 4910,
  "name": "Riche Antonio Santiago",
  "age": 29,
  "race": "H",
  "gender": "M",
  "armed": "gun",
  "location": "Salt Lake City",
  "date": "8/5/2019",
  "photo": "https://fatalencounters.org/wp-content/uploads/2019/08/Riche-Antonio-Santiago.jpg",
  "video": "K5HI-OA6EdA",
  "description": "#RicheSantiagoshooting  #slcpdhooting #SaltLakeCity\n\nSalt Lake City, Utah ---\nOfficer Involved Critical Incident (OICI)\n731 S. 300 E.\n19-143693\n\nThe Salt Lake City Police Department released 3 body cameras of an officers involved in fatal shooting occurred on August 5, 2019 around 7:20 p.m\n\nOfficers responded on a 911 hang up call at the Park Place at City Centre 731 S 300 E, Salt Lake City, UT 84111, USA address. An officer tracked a car there that had been involved in a previous shots fired incident. The officer found that the car was uninsured. A passenger in the back seat 29-year-old Riche Antonio Santiago, then gives the officer his name and birthdate and the officer runs a background check on him. The officer learned Santiago had outstanding warrants. The Officers told Santiago that he was under arrest than Santiago produced a gun and fired at officers. Officers returned fire. Medical treatment was given but Santiago was declared deceased at the scene. The OICI protocol was invoked with the West Valley Police lead OICI protocol team handling the investigation. No officers were injured.\n\nMore details in the video with SLCPD Captain Lance VanDongen news conference.\n\nIncident location:\nSalt Lake City, UT 84111.\n731 S. 300 E.\nUSAhttps://www.google.com/maps/place/731+S+300+E,+Salt+Lake+City,+UT+84111,+USA/@40.7532427,-111.8841527,17z/data=!3m1!4b1!4m5!3m4!1s0x8752f53f96edc479:0xc9f3c99d04d3ca7!8m2!3d40.7532427!4d-111.881964?entry=yt\n\n✅My entire channel has been demonetized. If ever you want to support the channel you could toss a $1 or $2 one-time tip or more if you want at:\n💲https://www.paypal.me/VideoLeakPolice .\nOr\n🟡Bitcoin: 1D5dqpHKvBq5Kg6C1wjyt68cpTqYaod6Uf.\nThank you for watching and thank you for your support and help.\n\n🔴Video Leak police on Bitchute (Like YouTube) https://www.bitchute.com/channel/cHahYjdeaKbV/\n\n🚨♦Disclaimer🚨: This video is NOT intended to be violent or glorify violence in any way. We are sharing the footage STRICTLY for the purposes of news reporting and educating. for training purpose, for public safety, to expose an injustice, documenting or foster debate about important events.🚨\n\nVideo Leak Police Primary Publish The New Police Dash Cam, , Police Officer Involved Shooting, Police Officer Body Camera footage releases. , New Police chases and more.\nAlso Video Leak Police publish news reporting videos, educational, for training purpose, Under Mini Documentary form, For public safety, to expose an injustice, documenting or foster debate about important events.\n\n🛑For any concern or Copyright Issue🛑 Please *Message me* ›\nhttps://www.facebook.com/videoleak01/\nor\n🛑https://www.youtube.com/channel/UCbQ4rmsy9dxaq5G6Om2DvfA/about?view_as=public\n\nYou are Welcome to Subscribe Here: https://www.youtube.com/c/VideoLeakPolice\n\nVideo Leak is Under Section 107 of the Copyright Act 1976, allowance is made for «fair use» for purposes such as criticism, comment, news reporting, teaching, scholarship, and research."
}