{
  "id": 5244,
  "name": "Jason Quincey Niccum",
  "age": 42,
  "race": "W",
  "gender": "M",
  "armed": "gun",
  "location": "Great Falls",
  "date": "11/25/2019",
  "photo": "https://fatalencounters.org/wp-content/uploads/2019/12/Jason-Quincey-Niccum.jpg",
  "video": "I1HPbs3Mc-Q",
  "description": "Jason Quincey Niccum has been identified as the man who died after he was shot during a stand-off with police and other law-enforcement officers in Great Falls on Monday.\n\nJohn Barnes of the Montana Department of Justice released the name on Wednesday afternoon, and said that Niccum was 42 years old.\n\nAt about 3:45 pm, officers from several law enforcement agencies, including the Great Falls Police Department, were involved in a situation with an armed suspect - later identified as Niccum - in the 1300 block of 3rd Alley Northwest. The response included the High-Risk Unit vehicle. The GFPD said in a Facebook post at the time that the incident was \"potentially volatile,\" and asked several nearby residents to leave the area until the situation was resolved.\n\nProbation & Parole officers and the U.S. Marshals Service Violent Offender Task Force initiated contact with Niccum, according to the MT DOJ. Niccum at the time was a probationer under supervision in Great Falls. Earlier that day, a no-bond warrant had been issued for his arrest for violating conditions of supervision.\n\nOfficers found Niccum in the driver’s seat of an SUV in an alleyway near 3rd Avenue NW and 13th Street NW, and he reportedly brandished a handgun while in the vehicle. Niccum was getting out of his vehicle with the handgun and a Deputy U.S. Marshal fired his weapon, hitting Niccum, who died at the scene. No officers were hurt in the incident.\n\nThe GFPD asked the Montana Department of Justice’s Division of Criminal Investigation to conduct an independent investigation into the incident and the shooting death, which is standard procedure whenever an officer is involved in a shooting. The Deputy U.S. Marshal involved in the shooting has been placed on administrative leave pending the investigation, which is also standard procedure in such cases. Petroleum County Coroner Dick Brown is serving as coroner and the state Medical Examiner’s Office will conduct the autopsy.\n\nNiccum has been in trouble with the law before, including leading police on a high-speed chase in Great Falls in 2015; he also had convictions for theft and drug-related crimes."
}