{
  "id": 5272,
  "name": "David N. Anderson",
  "age": 47,
  "race": "B",
  "gender": "M",
  "armed": "gun",
  "location": "Jersey City",
  "date": "12/10/2019",
  "photo": "https://fatalencounters.org/wp-content/uploads/2019/12/David-N.-Anderson.png",
  "video": "1yvSZMPGMwM",
  "description": "New Jersey Attorney General Gurbir Grewal said at a news conference with other officials on Wednesday that the two Jersey City attackers who stormed a Jewish market in a deadly shooting on Tuesday were the prime suspects in the death of a man whose body was found in a car trunk nearby over the weekend.\n\nGrewal identified the Jersey City attackers as 47-year-old David N. Anderson and 50-year-old Francine Graham.\n\nBoth were found dead at the scene of the attack at a kosher market Tuesday in Jersey City, along with three civilian victims. Authorities say Detective Joseph Seals was killed earlier near a cemetery about a mile away.\n\nAnderson and Graham, clearly targeted the place, the Jersey City mayor said Wednesday, amid growing fears the bloodshed was an anti-Semitic attack.\n\nAuthorities are investigating potential connections between the attackers and the Black Hebrew Israelite movement, some of whose members are known to rail against whites and Jews, a law enforcement official familiar with the case told the Associated Press.\n\nInvestigators also are scouring social media postings of at least one of the gunmen in search of a motive, said the official, who spoke on condition of anonymity because the investigation is still going on.\n\nSubscribe to our YouTube channel: https://bit.ly/2TwO8Gm\n\nQUICKTAKE ON SOCIAL:\nFollow QuickTake on Twitter: twitter.com/quicktake\nLike QuickTake on Facebook: facebook.com/quicktake\nFollow QuickTake on Instagram: instagram.com/quicktake\nSubscribe to our newsletter: https://bit.ly/2FJ0oQZ\nEmail us at quicktakenews@gmail.com\n\nQuickTake by Bloomberg is a global news network delivering up-to-the-minute analysis on the biggest news, trends and ideas for a new generation of leaders."
}